test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.2" jmeter="3.3 r1808647">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="测试计划" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="用户定义的变量" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="PC客户端上传订单_线上117822362909426892915697453784sixic" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <longProp name="ThreadGroup.start_time">1571714567000</longProp>
        <longProp name="ThreadGroup.end_time">1571714567000</longProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="订单上传" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;ownerId&quot;:&quot;117822362909426892915697453784sixic&quot;,&quot;no&quot;:${orderno},&quot;moneyChannel&quot;:&quot;2_&quot;,&quot;money&quot;:1115.0,&quot;source&quot;:1,&quot;moneyPay&quot;:1115.0,&quot;moneyRealIncome&quot;:1115.0,&quot;moneyChange&quot;:0.0,&quot;channelPay&quot;:&quot;2_1115.0,&quot;,&quot;payTime&quot;:&quot;2019-10-21 17:18:14&quot;,&quot;status&quot;:0,&quot;settlementer&quot;:&quot;17610831883&quot;,&quot;goodsId&quot;:[{&quot;goodsId&quot;:&quot;-1&quot;,&quot;goodsIndex&quot;:160079373413376,&quot;goodsNum&quot;:1.0,&quot;goodsPrice&quot;:1111.0,&quot;goodsOldPrice&quot;:1111.0,&quot;goodsName&quot;:&quot;无码商品&quot;,&quot;goodsPic&quot;:&quot;https://without-referer-1251363375.cos.ap-beijing.myqcloud.com/default-goods.jpg&quot;,&quot;goodsSpec&quot;:&quot;&quot;,&quot;goodsUnit&quot;:&quot;&quot;,&quot;goodsTotalPrice&quot;:1111.0},{&quot;goodsId&quot;:&quot;11843700991303147541571210810bf8eef&quot;,&quot;goodsIndex&quot;:160080144870401,&quot;goodsNum&quot;:1.0,&quot;goodsPrice&quot;:1.0,&quot;goodsOldPrice&quot;:1.0,&quot;goodsName&quot;:&quot;小包维达四层迷你纸巾666&quot;,&quot;goodsPic&quot;:&quot;https://mp-owner-1251363375.cos.ap-guangzhou.myqcloud.com/1571210809749.jpg&quot;,&quot;goodsSpec&quot;:&quot;8张&quot;,&quot;goodsUnit&quot;:&quot;包&quot;,&quot;goodsTotalPrice&quot;:1.0},{&quot;goodsId&quot;:&quot;11843693321179422731571210627pxgc7e&quot;,&quot;goodsIndex&quot;:160080373017601,&quot;goodsNum&quot;:1.0,&quot;goodsPrice&quot;:3.0,&quot;goodsOldPrice&quot;:3.0,&quot;goodsName&quot;:&quot;开心棉棉柔湿巾&quot;,&quot;goodsPic&quot;:&quot;https://mp-owner-1251363375.cos.ap-guangzhou.myqcloud.com/1571210626870.jpg,https://mp-owner-1251363375.cos.ap-guangzhou.myqcloud.com/1571210626913.jpg&quot;,&quot;goodsSpec&quot;:&quot;&quot;,&quot;goodsUnit&quot;:&quot;包&quot;,&quot;goodsTotalPrice&quot;:3.0}],&quot;vip&quot;:null,&quot;original&quot;:null,&quot;memberPhone&quot;:null,&quot;payList&quot;:[{&quot;sn&quot;:&quot;160080443517952&quot;,&quot;moneyChannel&quot;:2,&quot;money&quot;:1115.0,&quot;payTime&quot;:&quot;2019-10-21 17:18:14&quot;}]}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">hzcx.aiinp.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/user/order</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV 数据文件设置" enabled="true">
            <stringProp name="delimiter">,</stringProp>
            <stringProp name="fileEncoding">UTF-8</stringProp>
            <stringProp name="filename">E:\apache-jmeter-3.3\orderUpload.dat</stringProp>
            <boolProp name="ignoreFirstLine">false</boolProp>
            <boolProp name="quotedData">false</boolProp>
            <boolProp name="recycle">false</boolProp>
            <stringProp name="shareMode">shareMode.all</stringProp>
            <boolProp name="stopThread">true</boolProp>
            <stringProp name="variableNames">orderno,</stringProp>
          </CSVDataSet>
          <hashTree/>
        </hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Content-Type" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="Accept" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">*/*</stringProp>
            </elementProp>
            <elementProp name="Authorization" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer eyJhbGciOiJIUzUxMiJ9.eyJkZXZpY2VUeXBlIjoicGMiLCJyYW5kb21LZXkiOiJpdGZkcm4iLCJzdWIiOiI0NTExMCIsImV4cCI6MTU3MjI1NDExMCwiZGV2aWNlSWQiOiIxMTgyODQ3MTI3MjA2ODA5NjAxMTU3MDg0NzcwNm5ubHR6ZyIsImlhdCI6MTU3MTY0OTMxMH0.Vdh0JWs2zsAWXWgv4VaTaubjexupTlcOXj2tbDHtgyld1xdFeGm3emnlNWnAb19TzREOYNd0YrhszuaSdOFW9g</stringProp>
            </elementProp>
            <elementProp name="Host" elementType="Header">
              <stringProp name="Header.name">Host</stringProp>
              <stringProp name="Header.value">hzcx.aiinp.com</stringProp>
            </elementProp>
            <elementProp name="Content-Length" elementType="Header">
              <stringProp name="Header.name">Content-Length</stringProp>
              <stringProp name="Header.value">1429</stringProp>
            </elementProp>
            <elementProp name="Expect" elementType="Header">
              <stringProp name="Header.name">Expect</stringProp>
              <stringProp name="Header.value">100-continue</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="汇总报告" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="聚合报告" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="响应时间图" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="RespTimeGraph.interval">1000</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatGraphVisualizer" testclass="ResultCollector" testname="汇总图" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="用表格察看结果" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
    <WorkBench guiclass="WorkBenchGui" testclass="WorkBench" testname="工作台" enabled="true">
      <boolProp name="WorkBench.save">true</boolProp>
    </WorkBench>
    <hashTree/>
  </hashTree>
</jmeterTestPlan>