DashanEdu/学习8APP/summary3400.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
login,996,2012,25,7849,1652.37,6.325%,5.18593,6.15,2.19,1215.0
查询直播课列表（默认查询条件）,1497,697,74,9206,1297.00,65.531%,7.79801,24.68,2.93,3241.1
获取直播班级,5412,520,73,6546,1096.64,76.238%,28.17004,78.71,8.48,2861.3
提交试卷,2972,575,75,9089,952.45,66.521%,15.47369,10.63,19.81,703.6
练一练年级筛选,1292,595,74,5010,944.84,62.616%,6.73124,7.12,1.77,1083.7
获取校区分组,1149,698,74,5702,1242.66,63.795%,5.98993,59.44,1.57,10161.1
强制升级接口,983,2448,24,7262,1974.25,5.799%,5.12591,4.49,1.98,897.1
获取直播章节数据,5403,2755,3,8663,1912.75,15.806%,28.15940,48.56,13.34,1765.7
获取年级分组,1149,2613,23,8161,1819.80,11.227%,5.98515,7.93,2.26,1357.3
班课列表,4406,655,7,7191,1387.54,77.735%,22.91426,49.06,9.17,2192.4
HomePage,967,4123,22,10999,3230.40,6.515%,5.04526,16.41,1.96,3330.7
提交试卷—主观题,2972,2633,47,8380,1614.48,5.384%,15.48893,8.96,13.73,592.3
练一练列表——全部,1292,2145,19,7035,1614.35,11.146%,6.72724,20.71,2.84,3152.5
获取icon图标,943,2463,24,9167,2002.58,6.999%,4.92428,21.24,1.89,4416.1
直播课详情,1497,3328,23,9259,2383.69,15.832%,7.79744,33.00,3.26,4334.3
测评接口,1127,2986,23,9250,2026.96,10.382%,5.87340,6.87,2.63,1197.5
班课详情,4405,3369,23,9843,1940.68,10.329%,22.94259,165.58,9.34,7390.1
练一练列表——已做,1272,2423,24,7337,1723.71,9.906%,6.62873,8.77,2.94,1355.4
课程概述H5,1469,2544,23,13797,1988.13,17.495%,7.66373,33.27,2.69,4445.6
查看试卷列表,2915,2805,75,7887,1607.93,3.877%,15.20677,20.91,6.37,1408.1
获取banner图,933,2564,23,9543,2066.95,7.503%,4.87250,6.67,1.86,1401.2
获取直播课评价列表,1448,2604,23,6948,1938.70,15.608%,7.55710,13.02,3.45,1763.7
家校任务列表,1667,1241,31,13048,2409.68,69.166%,8.67470,12.60,2.27,1486.8
获取当前学生购物车商品数量,921,2518,10,8908,2022.75,7.600%,4.81257,2.67,1.94,567.6
做入学测、试卷_开始页面,1119,2847,24,9309,2697.60,13.315%,5.83569,3.81,2.76,668.2
老师主页—循环获取老师主页详情,1436,2916,23,9589,2307.58,18.802%,7.49717,29.00,3.21,3960.4
学生登录日志,907,2453,23,8802,2005.77,7.828%,4.74229,2.40,3.35,517.4
做入学测、试卷_题目页面,1095,2671,23,14803,2712.27,14.155%,5.71643,47.50,2.72,8509.1
查看练一练结果报告,1256,3383,23,9411,2024.45,8.439%,6.54934,173.31,2.73,27096.8
查看章节详情,1666,4924,23,10344,2846.33,9.004%,8.69865,20.93,3.54,2464.2
查看练一练解析,1233,2518,23,14558,1849.32,12.409%,6.44332,16.28,2.72,2587.5
做练习——开始页,1616,2049,24,6574,1644.83,10.087%,8.44928,4.84,3.90,586.0
HTTP Request,1077,4128,26,10309,2940.57,16.156%,5.62837,3.05,7.84,554.8
查看练一练排行榜,1208,3108,23,7974,2043.11,12.086%,6.31634,24.73,2.79,4009.3
做练习——试题页,1605,2580,23,6216,1651.34,8.411%,8.39694,12.25,3.82,1493.3
TOTAL,63305,2238,3,14803,2189.07,28.565%,328.86910,1002.08,159.48,3120.2