DashanEdu/学习8APP/summary500.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
login,22362,664,73,69056,1025.30,0.004%,62.19700,43.20,17.43,711.2
获取直播班级,29373,640,73,21802,898.88,0.000%,81.68992,57.53,24.63,721.2
强制升级接口,22325,60,16,28570,368.50,0.000%,62.15079,43.46,15.48,716.0
提交试卷,17094,655,74,69451,1083.06,0.012%,47.53351,33.20,60.85,715.2
获取直播章节数据,29321,56,16,21184,282.69,0.000%,81.58297,57.28,29.12,719.0
HomePage,22322,38,16,3825,89.93,0.000%,62.14106,42.84,15.95,706.0
查询直播课列表（默认查询条件）,25053,649,73,32316,915.48,0.000%,69.67877,49.09,26.18,721.4
获取icon图标,22320,37,16,4209,73.66,0.000%,62.13445,42.97,14.99,708.2
练一练年级筛选,24384,634,72,21851,880.40,0.000%,67.82226,47.24,17.87,713.3
班课列表,30018,627,71,60023,919.27,0.003%,83.48212,58.38,33.41,716.1
直播课详情,25010,56,16,9572,236.83,0.000%,69.61920,48.96,21.10,720.1
练一练列表——全部,24345,56,17,21377,298.63,0.000%,67.76222,47.13,21.58,712.2
家校任务列表,26684,637,73,24691,871.26,0.000%,74.20116,51.54,19.40,711.3
获取banner图,22316,37,16,3500,67.37,0.000%,62.12228,43.02,15.05,709.1
班课详情,29965,53,16,9659,230.28,0.000%,83.37762,58.22,25.25,715.0
练一练列表——已做,24344,37,16,4987,89.48,0.000%,67.75906,47.11,21.58,712.0
课程概述H5,25002,37,16,6920,88.30,0.000%,69.59538,51.82,14.77,762.5
获取当前学生购物车商品数量,22310,37,16,4557,73.20,0.000%,62.10540,43.24,16.36,713.0
查看章节详情,26646,54,16,9729,215.71,0.000%,74.15344,51.85,23.14,716.0
查看练一练结果报告,24341,36,16,6290,71.85,0.000%,67.75033,47.24,18.84,714.0
学生登录日志,22306,38,16,9388,124.12,0.000%,62.09289,43.66,35.22,720.0
获取校区分组,24381,634,73,21950,880.95,0.000%,67.79543,47.63,17.80,719.5
获取直播课评价列表,24998,37,17,9440,98.46,0.000%,69.58366,48.79,21.90,718.0
查看练一练解析,24334,36,16,3973,67.02,0.000%,67.73066,47.23,19.30,714.0
提交试卷—主观题,17056,276,72,9703,696.62,0.000%,47.50194,33.17,37.16,715.0
做练习——开始页,26638,38,16,5433,92.97,0.000%,74.13097,51.62,24.29,713.0
查看练一练排行榜,24329,36,16,9399,84.14,0.000%,67.71655,47.08,20.35,712.0
老师主页—循环获取老师主页详情,24994,36,17,4710,71.24,0.000%,69.57253,48.41,20.41,712.6
获取年级分组,24341,53,16,21703,274.42,0.000%,67.75750,47.12,17.79,712.1
做练习——试题页,26632,36,16,3320,70.29,0.000%,74.11407,51.60,24.28,713.0
测评接口,24334,38,17,5738,85.97,0.000%,67.73782,47.50,21.80,718.0
查看试卷列表,17044,266,72,69420,967.97,0.012%,47.43510,32.86,13.15,709.3
做入学测、试卷_开始页面,24332,38,17,9430,112.49,0.000%,67.73207,47.23,22.81,714.0
做入学测、试卷_题目页面,24326,36,16,8336,90.03,0.000%,67.71574,47.22,22.80,714.0
HTTP Request,24325,37,17,3465,60.36,0.000%,67.71258,47.48,86.87,718.0
TOTAL,849905,192,16,69451,560.57,0.001%,2362.88850,1652.30,858.06,716.1