DashanEdu/学习8APP/summary666.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
查询直播课列表（默认查询条件）,24213,975,74,21502,527.94,0.000%,67.33895,49.75,25.30,756.6
获取直播班级,27414,952,74,21092,536.05,0.000%,76.21966,61.77,22.98,829.9
login,22699,984,75,12455,512.89,0.000%,63.14978,44.01,17.70,713.6
提交试卷,20635,986,75,10425,453.06,0.000%,57.38033,40.05,73.46,714.8
获取直播章节数据,27338,44,16,4078,113.00,0.000%,76.06545,56.39,27.18,759.1
强制升级接口,22644,42,16,3470,114.72,0.000%,63.02816,44.20,15.70,718.1
练一练年级筛选,23434,980,74,21641,540.06,0.000%,65.14077,45.65,17.16,717.6
获取校区分组,23310,987,75,23320,580.14,0.000%,64.83645,53.09,17.02,838.5
HomePage,22639,36,16,6443,67.58,0.000%,63.02406,44.58,16.17,724.4
获取年级分组,23266,43,17,9419,155.56,0.000%,64.75008,45.27,17.00,715.9
班课列表,27218,955,74,10666,513.16,0.000%,75.66293,56.85,30.28,769.3
练一练列表——全部,23384,43,16,10140,145.05,0.000%,65.08573,46.15,20.51,726.1
提交试卷—主观题,20597,173,74,9656,337.98,0.000%,57.28677,39.99,44.81,714.8
获取icon图标,22634,35,17,3251,47.23,0.000%,63.02014,45.15,15.20,733.6
直播课详情,24159,44,16,9198,131.84,0.000%,67.21345,48.73,20.37,742.4
测评接口,23258,36,16,3478,56.18,0.000%,64.74025,45.61,20.55,721.4
课程概述H5,24150,36,16,3235,56.31,0.000%,67.23892,51.38,14.27,782.5
班课详情,27147,46,16,6596,134.48,0.000%,75.55441,56.73,22.66,768.9
获取banner图,22633,35,16,2094,43.57,0.000%,63.02473,43.98,15.26,714.5
练一练列表——已做,23378,35,16,3616,51.44,0.000%,65.08896,45.55,20.51,716.6
获取直播课评价列表,24144,35,16,2154,42.09,0.000%,67.23251,47.55,21.16,724.2
家校任务列表,25023,972,73,12220,516.23,0.000%,69.57578,49.20,18.19,724.1
查看试卷列表,20575,167,74,12471,311.15,0.000%,57.30527,40.01,15.89,715.0
获取当前学生购物车商品数量,22626,35,16,3223,52.11,0.000%,63.01963,43.88,16.60,713.0
做入学测、试卷_开始页面,23252,35,17,3112,47.62,0.000%,64.73995,45.17,21.80,714.5
老师主页—循环获取老师主页详情,24138,35,17,2356,44.71,0.000%,67.22666,47.90,19.72,729.6
学生登录日志,22619,35,17,2567,42.71,0.000%,63.01171,44.29,35.74,719.7
做入学测、试卷_题目页面,23240,35,17,2149,39.80,0.000%,64.73105,47.71,21.80,754.7
查看章节详情,24962,44,16,9180,121.90,0.000%,69.56536,49.13,21.34,723.3
做练习——开始页,24950,37,17,3390,47.82,0.000%,69.57885,48.46,22.43,713.2
HTTP Request,23235,36,16,3444,49.78,0.000%,64.74327,45.39,83.06,717.9
查看练一练结果报告,23372,36,16,3145,56.45,0.000%,65.09364,53.31,18.10,838.6
做练习——试题页,24946,37,16,3144,51.52,0.000%,69.58341,48.67,22.43,716.2
查看练一练解析,23363,35,17,3575,51.15,0.000%,65.15113,46.04,18.56,723.7
查看练一练排行榜,23355,35,16,3229,47.88,0.000%,65.14408,46.35,19.58,728.6
TOTAL,829950,263,16,23320,478.48,0.000%,2306.40329,1664.98,849.01,739.2